{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 128, 128, 3], "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "kernel_size": [4, 4], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "trainable": true, "dtype": "float32", "data_format": "channels_last", "padding": "same", "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "data_format": "channels_last", "padding": "same", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [4, 4], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [4, 4]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "padding": "same", "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "padding": "same", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_5", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_6", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "padding": "same", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "units": 256, "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "units": 256, "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_3", "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "units": 2, "kernel_regularizer": null, "use_bias": true}}]}