{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "kernel_regularizer": null, "trainable": true, "dtype": "float32", "batch_input_shape": [null, 128, 128, 3], "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "name": "conv2d_1", "use_bias": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 32, "name": "conv2d_2", "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [4, 4], "trainable": true, "strides": [4, 4], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 64, "name": "conv2d_3", "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 64, "name": "conv2d_4", "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 128, "name": "conv2d_5", "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "filters": 128, "name": "conv2d_6", "use_bias": true, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 128, "activity_regularizer": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 64, "activity_regularizer": null, "bias_constraint": null, "name": "dense_2", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 2, "activity_regularizer": null, "bias_constraint": null, "name": "dense_3", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}}], "keras_version": "2.0.6"}