{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv1", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [2, 2], "filters": 32, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv1_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv1_relu", "class_name": "Activation", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv1_relu", "trainable": false}}, {"name": "conv_dw_1", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_1", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_1_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_1_relu", "trainable": false}}, {"name": "conv_pw_1", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_1", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 64, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_1_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_1_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_1_relu", "trainable": false}}, {"name": "conv_dw_2", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_2", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [2, 2], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_2_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_2_relu", "trainable": false}}, {"name": "conv_pw_2", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_2", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 128, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_2_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_2_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_2_relu", "trainable": false}}, {"name": "conv_dw_3", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_3", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_3_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_3_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_3_relu", "trainable": false}}, {"name": "conv_pw_3", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_3", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 128, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_3_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_3_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_3_relu", "trainable": false}}, {"name": "conv_dw_4", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_4", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [2, 2], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_4_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_4_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_4_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_4_relu", "trainable": false}}, {"name": "conv_pw_4", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_4", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 256, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_4_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_4_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_4_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_4_relu", "trainable": false}}, {"name": "conv_dw_5", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_5", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_5_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_5_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_5_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_5_relu", "trainable": false}}, {"name": "conv_pw_5", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_5", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 256, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_5_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_5_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_5_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_5_relu", "trainable": false}}, {"name": "conv_dw_6", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_6", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [2, 2], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_6_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_6_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_6_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_6_relu", "trainable": false}}, {"name": "conv_pw_6", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_6", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 512, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_6_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_6_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_6_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_6_relu", "trainable": false}}, {"name": "conv_dw_7", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_7", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_7_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_7_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_7_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_7_relu", "trainable": false}}, {"name": "conv_pw_7", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_7", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 512, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_7_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_7_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_7_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_7_relu", "trainable": false}}, {"name": "conv_dw_8", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_8", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_8_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_8_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_8_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_8_relu", "trainable": false}}, {"name": "conv_pw_8", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_8", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 512, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_8_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_8_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_8_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_8_relu", "trainable": false}}, {"name": "conv_dw_9", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_9", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_9_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_9_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_9_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_9_relu", "trainable": false}}, {"name": "conv_pw_9", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_9", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 512, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_9_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_9_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_9_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_9_relu", "trainable": false}}, {"name": "conv_dw_10", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_10", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_10_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_10_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_10_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_10_relu", "trainable": false}}, {"name": "conv_pw_10", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_10", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 512, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_10_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_10_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_10_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_10_relu", "trainable": false}}, {"name": "conv_dw_11", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_11", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_11_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_11_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_11_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_11_relu", "trainable": false}}, {"name": "conv_pw_11", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_11", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 512, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_11_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_11_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_11_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_11_relu", "trainable": false}}, {"name": "conv_dw_12", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_12", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [2, 2], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_12_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_12_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_12_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_12_relu", "trainable": false}}, {"name": "conv_pw_12", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_12", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 1024, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_12_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_12_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_12_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_12_relu", "trainable": false}}, {"name": "conv_dw_13", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"activation": "linear", "name": "conv_dw_13", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "depthwise_regularizer": null, "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "padding": "same", "trainable": false, "depth_multiplier": 1, "depthwise_constraint": null}}, {"name": "conv_dw_13_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_dw_13_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_dw_13_relu", "class_name": "Activation", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_dw_13_relu", "trainable": false}}, {"name": "conv_pw_13", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"activation": "linear", "kernel_regularizer": null, "name": "conv_pw_13", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "bias_constraint": null, "use_bias": false, "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_constraint": null, "strides": [1, 1], "filters": 1024, "padding": "same", "trainable": false, "bias_regularizer": null}}, {"name": "conv_pw_13_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"momentum": 0.99, "beta_regularizer": null, "name": "conv_pw_13_bn", "scale": true, "trainable": false, "gamma_constraint": null, "center": true, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001}}, {"name": "conv_pw_13_relu", "class_name": "Activation", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"activation": "relu6", "name": "conv_pw_13_relu", "trainable": false}}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"activation": "relu", "kernel_regularizer": null, "name": "dense_1", "units": 1024, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"activation": "softmax", "kernel_regularizer": null, "name": "dense_2", "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "kernel_constraint": null}}]}}